// ! =========================

// Функція checkPassword отримує пароль користувача у параметр password, перевіряє його на збіг
// з паролем адміністратора у змінній ADMIN_PASSWORD і повертає повідомлення про результат порівняння.

// Виконай рефакторинг коду функції checkPassword, використовуючи патерн «раннє повернення»:

// видали змінну message
// видали else
// код повинен працювати так само, як і до оптимізації

// function checkPassword(password) {
//     const ADMIN_PASSWORD = 'jqueryismyjam';

//     let message;

//     if (password === ADMIN_PASSWORD) {
//         message = 'Welcome!';
//     } else {
//         message = 'Access denied, wrong password!';
//     }

//     return message;
// }

// function checkPassword(password) {
//     const ADMIN_PASSWORD = 'jqueryismyjam';

//     if (password === ADMIN_PASSWORD) {
//         return 'Welcome!';
//     }
//     return 'Access denied, wrong password!';
// }

// ! =========================

// Знайдемо індекус порожніх елементів і додамо їх в змінну indexesOfEmptyElements

// const arr = [1, 2, , 4, , 6];
// const indexesOfEmptyElements = [];

// for (let i = 0; i < arr.length; i += 1) {
//     if (typeof arr[i] === 'undefined') indexesOfEmptyElements.push(i);
// }

// console.log(indexesOfEmptyElements);

// ! ============================

// Example 1 - Базові операції з масивом
// Створіть масив genres з елементами «Jazz» та «Blues».
// Додайте «Рок-н-рол» до кінця.
// Виведіть у консоль перший елемент масиву.
// Виведіть у консоль останній елемент масиву. Код повинен працювати для масиву довільної довжини.
// Видаліть перший елемент та виведіть його в консоль.
// Вставте «Country» та «Reggae» на початок масиву.

// const genres = ['Jazz', 'Blues'];

// genres.push('Рок-н-рол');

// console.log(genres);

// console.log(genres[0]);

// const arrLength = genres.length - 1;

// console.log(genres[arrLength]);

// 1 variant
// console.log(genres.shift());

// 2 variant
// console.log(genres.splice(0, 1)[0]);
// console.log(genres);

// genres.unshift('Country', 'Reggae');
// console.log(genres);

// ! ============================

// Example 2 - Масиви та рядки
// Напиши скрипт для обчислення площі прямокутника зі сторонами, значення яких зберігаються
// у змінній values у вигляді рядка.Значення гарантовано розділені пробілом.

// const values = '10 11';

// const valuesArray = values.split(' ');

// console.log(valuesArray);

// console.log(valuesArray[0] * valuesArray[1]);

// ! ============================

// Example 3 - Перебір масиву
// Напиши скрипт для перебору масиву fruits циклом for.Для кожного елемента масиву
// виведи в консоль рядок у форматі номер_елемента: значення_елемента.Нумерація елементів повинна починатися з 1.

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

// for (let i = 0; i < fruits.length; i += 1) {
//     console.log(`${i + 1}: ${fruits[i]}`);
// }

// ! ============================

// Example 4 - Масиви та цикли
// Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача.
// У змінних names та phones зберігаються рядки імен та телефонних номерів, розділені комами.
// Порядковий номер імен та телефонів у рядках вказують на відповідність.Кількість імен та телефонів гарантовано однакова.

// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';

// const namerArray = names.split(',');
// console.log(namerArray);
// const phonesArray = phones.split(',');
// console.log(phonesArray);

// for (const i in namerArray) {
//     console.log(`${namerArray[i]}: ${phonesArray[i]}`);
// }

// ! ============================
